In [4]:
import pandas as pd
df = pd.read_csv('salaries9.csv')
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [5]:
inputs = df.drop('salary_more_then_100k', axis ='columns')
y = df['salary_more_then_100k']

In [6]:
from sklearn.preprocessing import LabelEncoder
lec = LabelEncoder()
lej = LabelEncoder()
led = LabelEncoder()

In [7]:
inputs['comn'] = lec.fit_transform(inputs.company)
inputs['jobn'] = lej.fit_transform(inputs.job)
inputs['degreen'] = led.fit_transform(inputs.degree)
inputs.head()

  company                  job     degree  comn  jobn  degreen
0  google      sales executive  bachelors     2     2        0
1  google      sales executive    masters     2     2        1
2  google     business manager  bachelors     2     0        0
3  google     business manager    masters     2     0        1
4  google  computer programmer  bachelors     2     1        0

In [8]:
inputsn = inputs.drop(['company', 'job','degree'], axis = 'columns')
inputsn.head()

   comn  jobn  degreen
0     2     2        0
1     2     2        1
2     2     0        0
3     2     0        1
4     2     1        0

In [9]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [10]:
model.fit(inputsn, y)

DecisionTreeClassifier()

In [11]:
model.score(inputsn,y)

1.0

In [12]:
model.predict([[2,2,1]])

array([0], dtype=int64)

In [13]:
model.predict([[2,0,1]])

array([1], dtype=int64)

### Homework

In [23]:
import pandas as pd
df1 = pd.read_csv("titanic9.csv")
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [24]:
df1.shape

(891, 12)

In [35]:
df2 = df1.drop(['PassengerId', 'Survived','Name','SibSp','Parch', 'Ticket', 'Cabin','Embarked'],axis = 'columns')
y = df1.Survived

In [36]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [37]:
df2['sexn']=le.fit_transform(df1.Sex)

In [43]:
import math
df2.Age = df2.Age.fillna(df2.Age.mean())

In [44]:
x = df2.drop(['Sex'] ,axis ='columns')
x

     Pclass        Age     Fare  sexn
0         3  22.000000   7.2500     1
1         1  38.000000  71.2833     0
2         3  26.000000   7.9250     0
3         1  35.000000  53.1000     0
4         3  35.000000   8.0500     1
..      ...        ...      ...   ...
886       2  27.000000  13.0000     1
887       1  19.000000  30.0000     0
888       3  29.699118  23.4500     0
889       1  26.000000  30.0000     1
890       3  32.000000   7.7500     1

[891 rows x 4 columns]

In [45]:
from sklearn import tree
model1 = tree.DecisionTreeClassifier()

In [49]:
from sklearn.model_selection import train_test_split
xtrain, xtest, ytrain, ytest = train_test_split(x, y, test_size= 0.2, random_state = 5)

In [50]:
model1.fit(xtrain,ytrain)

DecisionTreeClassifier()

In [52]:
model1.predict(xtest)

array([0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1,
       0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0,
       0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1,
       0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0,
       0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0,
       0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0,
       0, 1, 1], dtype=int64)

In [53]:
model1.score(xtest,ytest)

0.8044692737430168